CASES/FWV4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1;

vertices
(
    (0.0 0.0 -7.5)
    (2.5 0.0 -7.5)
    (2.5 2.5 -7.5)
    (0.0 2.5 -7.5)
    (0.0 0.0 2.0)
    (2.5 0.0 2.0)
    (2.5 2.5 2.0)
    (0.0 2.5 2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 95) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (4 5 6 7) );
    }
    outlet
    {
        type patch;
        faces ( (0 3 2 1) );
    }
    ground
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    farField
    {
        type patch;
        faces ( (1 2 6 5) (2 3 7 6) );
    }
    symmetry
    {
        type symmetry;
        faces ( (0 4 7 3) );
    }
);

mergePatchPairs ();


// ************************************************************************* //
